---
kind: method
id: M:Autodesk.Revit.UI.ColorSelectionDialog.#ctor
source: html/70130da5-f088-9113-29ee-9dcf917bde73.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public ColorSelectionDialog()
```